Repository: belgium-its-steering-committee/ckanext-benap
Catalog: ckanext/benap/i18n/*/LC_MESSAGES/ckanext-benap.po
Languages: de, fr, nl

source: Transportation modes
nl: Vervoersmodi

source: Area covered by publication
nl: Gebied gedekt door publicatie

source: Mobility Theme
nl: Mobiliteitsthema

source: Please select the file to upload again
de: Bitte wählen Sie die Datei zum Hochladen erneut aus
nl: Gelieve het bestand te selecteren om opnieuw te uploaden

source: Phone number {number} is not a valid format
de: Die Telefonnummer {number} ist nicht in einem gultigen Format.
fr: Le numéro de téléphone {number} n'a pas un format valide.
nl: Het telefoonnummer {number} is niet in een geldig formaat.

source: Belgium is a required country
de: Belgien ist ein erforderliches Land
fr: La Belgique est un pays requis
nl: België is een verplicht land

source: Start date must be before end date
de: Das Startdatum muss vor dem Enddatum liegen
fr: La date de début doit être antérieure à la date de fin
nl: Startdatum moet voor de einddatum zijn

source: URL {url} has to start with https://
de: Die URL {url} muss mit https:// beginnen.
fr: L'URL {url} doit débuter par https://
nl: URL {url} moet starten met de prefix https://

source: Select at least one
de: Wählen Sie mindestens einen Eintrag
nl: Selecteer minstens één

source: The license text is missing. The license text is required for at least one language because "Other" was chosen as the license type.
nl: De licentietekst ontbreekt. De licentietekst is vereist voor minstens één taal omdat “Andere” gekozen is als licentietype.

source: Belgium&#39;s national access point for multimodal travel information services.
fr: Point d&#39;accès national belge pour les services d'information sur les déplacements multimodaux
nl: Belgisch nationaal toegangspunt voor informatiediensten over multimodale verplaatsingen.

source: Follow us on LinkedIn
de: Folgen Sie uns auf LinkedIn
fr: Suivez nous sur LinkedIn
nl: Volg ons op LinkedIn

source: About Transportdata.be
de: Über Transportdata.be
fr: A propos de Transportdata.be
nl: Over Transportdata.be

source: Manage Cookies
de: Cookies verwalten
fr: Gérer les Cookies
nl: Cookies beheren

source: 2025 - By the National Geographic Institute on behalf of the ITS steering commitee.
de: 2025 - By the National Geographic Institute on behalf of the ITS steering committee.
fr: 2025 - By the National Geographic Institute on behalf of the ITS steering committee.
nl: 2025 - By the National Geographic Institute on behalf of the ITS steering committee.

source: Transportdata.be uses cookies to improve your experience. These cookies are used to gather and analyse information about your visit. For the best experience of the website, choose “Accept all cookies”. If you prefer to specify which information you want to share with Transportdata.be, choose “Set preferences”. Transportdata.be saves your cookie preferences. You can change your cookie preferences by clicking “Manage cookies”. Want to know more?
de: Transportdata.be verwendet Cookies, um Ihre Erfahrung zu verbessern.Diese Cookies werden verwendet, um Informationen über Ihren Besuch zu sammeln und zu analysieren.Für die beste Erfahrung der Website, wählen Sie “Alle Cookies akzeptieren”.Wenn Sie es vorziehen Geben Sie an, welche Informationen Sie mit Transportdata.be teilen möchten “Einstellungen festlegen”.Transportdata.be speichert Ihre Cookie-Einstellungen. Sie können Ihre Cookie-Einstellungen ändern, indem Sie auf “Cookies verwalten” klicken. Möchten Sie mehr wissen?
fr: Transportdata.be utilise des cookies pour améliorer votre expérience.Ces cookies sont utilisé pour recueillir et analyser des informations sur votre visite.Pour le meilleur expérience du site Web, choisissez “Accepter tous les cookies”.Si vous préférez de spécifiez les informations que vous souhaitez partager avec Transportdata.be, choisissez “Définir les préférences”.Transportdata.be enregistre vos préférences de cookies. Vous pouvez modifiez vos préférences de cookies en cliquant sur “Gérer les cookies”. Voulez savoirplus?
nl: Transportdata.be maakt gebruik van cookies om uw gebruikservaring te verbeteren. Aan de hand van deze cookies verzamelt en analyseert Transportdata.be informatie over uw bezoek. Voor een optimale werking kiest u “alle cookies toestaan”. Indien u zelf wil kiezen welke informatie u met Transportdata.be deelt kiest u “Stel voorkeuren in”. Transportdata.be bewaart uw cookievoorkeuren. U kan deze aanpassen via “cookies beheren”.

source: Consult our Privacy declaration.
de: Konsultieren Sie unsere Datenschutzerklärung.
fr: Consultez notre déclaration de confidentialité.
nl: Lees onze Privacy verklaring.

source: Accept all cookies
de: Alle Cookies akzeptieren
fr: Accepter tous les cookies
nl: Alle cookies toestaan

source: Set preferences
de: Einstellungen festlegen
fr: Définir les preferences
nl: Stel voorkeuren in

source: Types of Cookies
de: Arten von Cookies
fr: Types de Cookies
nl: Soorten Cookies

source: Essential
de: Essenziell
fr: Essentiels
nl: Noodzakelijk

source: Always enabled
de: Immer aktiviert
fr: Toujours activé
nl: Altijd ingeschakeld

source: Essential cookies are cookies that are required for the correct functioning of the website.
de: Essenzielle Cookies sind solche, die notwendig für das (bessere) Funktionieren einer Website sind, wie z. B. Cookies zur Verwaltung der Ladezeit von Webseiten.
fr: Les cookies essentiels sont nécessaires pour (mieux) faire fonctionner un site web, par exemple les cookies gérant le délai de chargement de pages web.
nl: Noodzakelijke cookies zijn cookies die ervoor zorgen dat alle onderdelen van de website goed werken.

source: Expiry
de: Aufbewahrungsfrist
fr: Expiration
nl: Duur

source: Purpose
de: Ziel
fr: Finalité
nl: Doel

source: Basic functionality
de: Basisfunktionalitäten
fr: Fonctionnalité de base
nl: Basisfunctionaliteit

source: session
de: Sitzung
nl: sessie

source: This cookie is used for the basic functionalities of the website.
de: Wird für die Basisfunktionalitäten der Website verwendet.
fr: Ce cookie est utilisé pour les fonctionnalités de base du site web.
nl: Deze cookie wordt gebruikt voor de basisfunctionaliteiten van de website

source: Functional
de: Funktional
fr: Functionnels
nl: Functioneel

source: Disabled
de: Behindert
fr: Désactivé
nl: Uitgeschakeld

source: Functional cookies record information about the user's choices and preferences and may store language settings, for instance.
de: Funktionelle Cookies erheben Informationen über die Wahl und die Präferenzen des Nutzers und bieten beispielsweise die Möglichkeit, Spracheinstellungen zu speichern.
fr: Les cookies fonctionnels collectent des informations sur les choix et préférences de l’utilisateur, et offrent par exemple la possibilité de retenir les paramètres linguistiques.
nl: Functionele cookies onthouden uw voorkeursinstellingen.

source: Proper functionality
de: Basisfunktionalitäten
fr: Functionnalité de base
nl: Basisfunctionaliteiten

source: 1 year
de: 1 Jahr
fr: 1 an
nl: 1 jaar

source: This cookie is used to store user preferences.
de: Dieses Cookie wird zum Speichern von Benutzereinstellungen verwendet.
fr: Ce cookie est utilisé pour sauvegarder les préférences de l’utilisateur.
nl: Deze cookie slaat de gebruikersinstellingen op.

source: Analytical
de: Analytisch
fr: Analytique
nl: Analytisch

source: These cookies collect information about the user's behaviour to measure the performance of the website and improve the user experience.
de: Analytische oder Performance-Cookies erheben Informationen über das Nutzungsverhalten, um die Leistungen der betreffenden Website zu messen und die Nutzungserfahrung zu verbessern.
fr: Les cookies analytiques ou de performance collectent des informations sur le comportement d’utilisateur afin de mesurer les prestations du site web en question et d’améliorer l’expérience d’utilisation.
nl: Analytische cookies meten het websitebezoek. Deze gegevens laten ons toe om de structuur, navigatie en inhoud van onze website te verbeteren.

source: Statistics, HTTP
de: Statistik, HTTP
fr: Statistiques, HTTP
nl: Statistieken, HTTP

source: 2 years
de: 2 Jahre
fr: 2 ans
nl: 2 jaar

source: Registers a unique ID that is used to generate statistical data on how the visitor uses the website.
de: Registriert eine einzigartige ID, die verwendet wird, um statistische Daten über die Nutzung der Website durch die Nutzer zu erheben.
fr: Enregistre une ID unique utilisée pour générer des données statistiques sur la manière dont le visiteur utilise le site web.
nl: Registreert een unieke ID die gebruikt wordt om statistische data te genereren over het gebruik van de website door de gebruikers.

source: 1 day
de: 1 Tag
fr: 1 jour
nl: 1 dag

source: Used By Google Analytics to throttle request rate.
de: Wird von Google Analytics verwendet, um die Anfragegeschwindigkeit zu verlangsamen.
fr: Utilisé par Google Analytics pour limiter la cadence des requêtes
nl: Gebruikt door Google Analytics om verzoeksnelheid te vertragen.

source: Marketing cookies follow the user's browsing behaviour in order to compose customer profiles or user profiles. These profiles are commonly used to show relevant and personalised ads that match the user's interests. They are also used to measure the effectiveness of promotions and to conduct market analyses.
de: Marketing Cookies verfolgen das Surfverhalten des Nutzers, um Kunden- oder Benutzerprofile zu erstellen.Diese Profile werden meist verwendet, um relevante und personalisierte Anzeigen anzuzeigen, die den Interessen der jeweiligen Nutzer entsprechen. Außerdem werden Sie genutzt, um die Effizienz von Werbekampagnen zu messen und Marktanalysen durchzuführen.
fr: Les cookies de Marketing suivent le comportement de navigation de l’utilisateur afin de constituer des profils de clients et d’utilisateurs. Lesdits profils sont généralement utilisés pour afficher des publicités pertinentes et personnalisées correspondant aux intérêts des utilisateurs correspondants.
nl: U dient marketing cookies in te schakelen om op de website inhoud te tonen die afkomstig is van derde partijen.

source: This cookie is used to send data to Google Analytics about the visitor's device and behavior. It tracks the visitor across devices and marketing channels.
de: Wird verwendet, um Daten über Besuche und Geräte an Google Analytics weiterzuleiten. Das Cookie verfolgt den Benutzer über verschiedene Geräte und Marketingkanäle.
fr: Ce cookie est utilize pour envoyer des données à Google Analytics sur l’appareil et le comportement du visiteur. Il suit le visiteur à travers les appareils et les canaux de marketing.
nl: Deze cookie Wordt gebruikt om data over bezoeken en devices door te sturen naar Google Analytics. De cookie trackt de gebruiker over verschillende devices en marketing kanalen.

source: Save preferences
de: Einstellungen speichern
fr: Enregistrer les préférences
nl: Voorkeuren opslaan

source: Subscribe to our newsletter and stay informed
de: Abonnieren Sie unseren Newsletter und bleiben Sie informiert
fr: Pour rester informé, inscrivez-vous à la lettre de diffusion
nl: Schrijf u in op onze nieuwsbrief

source: Enter your email address
de: Geben sie ihre E-Mailadresse ein
fr: Entrez votre adresse email
nl: Vul uw e-mailadres in

source: Subscribe
de: Abonnieren
fr: Inscrivez-vous
nl: Abonneren

source: https://www.youtube-nocookie.com/embed/0-M48xzlWzI?rel=0&enablejsapi=1
nl: https://www.youtube-nocookie.com/embed/jle8RPRW1Do?rel=0&enablejsapi=1

source: Introduction to transportdata.be
nl: Introductie Transportdata.be

source: Click to accept YouTube cookies and watch the video
nl: Klik om YouTube-cookies te accepteren en de video te bekijken

source: JOIN OUR COMMUNITY FORUM
de: ZUGANG UND (WIEDER-)VERWENDUNG VON INHALTEN AUS DEN NAP ITS
fr: ACCÉDER ET (RÉ)UTILISER LE CONTENU DU NAP ITS
nl: TOEGANG TOT EN (HER)GEBRUIK VAN INHOUD VAN HET NAP ITS

source: As transport data producer or user, join our online community and benefit from experience-sharing with your fellows!
de: Lernen Sie, wie Sie Datensätze und Dienste abfragen können.
fr: Apprenez comment consulter les jeux de données et services.
nl: Leer hoe u datasets en diensten kan raadplegen.

source: Discover the Belgian transport landscape.
de: Entdecken Sie die belgische Verkehrslandschaft.
fr: Découvrez le secteur belge de transport.
nl: Ontdek het Belgische transportlandschap.

source: Obtain practical information on how to (re)use datasets and services from the NAP ITS.
de: Praktische Informationen über die (Wieder-)Verwendung von Datensätzen und Diensten des NAP ITS erhalten.
fr: Obtenez des informations pratiques sur la manière de (ré)utiliser les jeux de données et les services du NAP ITS.
nl: Verkrijg praktische informatie over hoe u datasets en diensten van het NAP ITS kan (her)gebruiken.

source: Join
de: Melden Sie sich an
fr: Inscrivez-vous
nl: Sluit u aan

source: Need help?
de: Brauchen Sie Hilfe?
fr: Besoin d'aide?
nl: Hulp nodig?

source: Contact
de: Kontaktieren
fr: Contactez
nl: Contacteer

source: our helpdesk.
de: Sie unseren Helpdesk
fr: notre service d'assistance
nl: onze helpdesk

source: DISCOVER TRANSPORTDATA.BE
de: ENTDECKEN SIE NAP ITS & REGISTER CONTENT
fr: DECOUVREZ LE NAP ITS & ENREGISTRER DU CONTENU
nl: ONTDEK HET NAP ITS & REGISTREER CONTENT

source: AND HOW YOU ARE INVOLVED
de: UND WIE SIE DARAN BETEILIGT SIND
fr: ET COMMENT VOUS ÊTES IMPLIQUÉ
nl: EN HOE U DAARIN BETROKKEN BENT

source: Transportdata.be is the preferred access point for information on Intelligent Transport Systems (ITS). This national platform aims to centralize access to ITS datasets and web services.
de: Transportdata.be ist die belgische nationale Zugangspunkt für intelligente Transportsysteme und besteht aus Daten über:
fr: Transportdata.be est le point d'accès national Belge pour les systèmes de transport intelligents et contient des données concernant:
nl: Transportdata.be is het Belgische nationale toegangspunt voor intelligente transportsystemen en bevat data betreffende:

source: MMTIS
de: Multimodale Reiseinformationsdienste (MMTIS)
fr: Services d’informations sur les déplacements multimodaux (MMTIS)
nl: Multimodale reisinformatie-diensten (MMTIS)

source: RRTI
de: Echtzeit Verkehrsinformationsdienste (RTTI)
fr: Services d’informations en temps réel sur la circulation (RTTI)
nl: Real-Time verkeersinformatie (RRTI)

source: SRTI
de: Straßenverkehrssicherheit relevanter Verkehrsinformationen (SRTI)
fr: Informations liées à la sécurité routière (SRTI)
nl: Verkeersveiligheidsinformatie (SRTI)

source: SSTP
de: Informationsdiensten für sichere Parkplätze für Lastkraftwagen und andere gewerbliche Fahrzeuge (SSTP)
fr: Services d’informations concernant les aires de stationnement sûres et sécurisées pour les camions et les véhicules commerciaux (SSTP)
nl: Informatiediensten voor veilige en beveiligde parkeerplaatsen voor Vrachtwagens en bedrijfsvoertuigen (SSTP)

source: Obtain practical information on how to register your organization, datasets and services.
de: Praktische Informationen erhalten über wie Sie Ihre Organisation, Ihre Datensätze und Ihre Dienste registrieren können.
fr: Obtenez des informations pratiques sur la manière d'enregistrer votre organisation, vos ensembles de données et vos services.
nl: Raadpleeg praktische informatie over hoe u uw organisatie, datasets en diensten kan registreren.

source: BELGIUM'S NATIONAL ACCESS POINT FOR MULTIMODAL TRAVEL INFORMATION SERVICES
de: Nationales belgischer Zugangspunkt für intelligente Verkehrssysteme (NAP ITS)
fr: Point d&#39;accès national belge pour les systèmes de transport intelligents (NAP ITS)
nl: Belgisch nationaal toegangspunt voor intelligente transportsystemen (NAP ITS)

source: SEARCH FOR DATA SETS
de: SUCHEN NACH DATENSÄTZEN UND DIENSTEN
fr: RECHERCHER DES JEUX DE DONNEES & SERVICES
nl: ZOEK NAAR DATASETS & DIENSTEN

source: ex. transport, cars, trains, ...
de: z.B. Carsharing, Zug, Fahrradvermietung, usw.
fr: ex. autopartage, train, location de vélos, etc.
nl: Bv. autodelen, trein, fietsverhuur, enz.

source: Popular Tags
de: Frequente Tags
fr: Tags fréquents
nl: Populaire tags

source: ADD NEW DATA
de: Datensätze und Dienste hinzufügen
fr: Ajouter des jeux de données et services
nl: Datasets en diensten toevoegen

source: Data providers can easily add data to the catalogue.
de: Datenanbieter können auf einfache Wiese Datenstäze und Dienste auf dem NAP ITS registrieren.
fr: Les fournisseurs de données peuvent facilement enregistrer des données et des services sur le NAP ITS.
nl: Gegevensaanbieders kunnen eenvoudig datasets en diensten registreren op het NAP ITS.

source: Add Data
de: Daten hinzufügen
fr: Ajouter données
nl: Gegevens toevoegen

source: close
de: schließen
fr: fermer
nl: Sluit

source: metadata checked & verified
de: metadaten geprüft und verifiziert
fr: métadonnées vérifiées et contrôlées
nl: metadata gecontroleerd en gevalideerd

source: A resource is preferrably a link to your transport dataset or transport data service. However, if access requires authentification or signature of a license agreement, you may just add a link to your website/data portal. If your data is not hosted on an existing website, in that case you may upload it on transportdata.be
de: Eine Ressource ist vorzugsweise eine Verknüpfung zu Ihrem Transportdatensatz oder Transportdatendienst. Wenn für den Zugriff jedoch die Authentifizierung oder die Unterzeichnung einer Lizenzvereinbarung erforderlich ist, können Sie einfach einen Link zu Ihrer Website/Ihrem Datenportal hinzufügen. Wenn Ihre Daten nicht auf einer vorhandenen Website gehostet werden, können Sie sie in diesem Fall auf transportdata.be hochladen
fr: Une ressource est de préférence un lien vers votre jeu de données de transport ou votre service de données de transport. Toutefois, si l'accès nécessite une authentification ou la signature d'un contrat de licence, vous pouvez simplement ajouter un lien vers votre site Web / portail de données. Si vos données ne sont pas hébergées sur un site web existant, dans ce cas, vous pouvez les télécharger sur transportdata.be.
nl: Een resource is bij voorkeur een link naar uw transportdataset of transportdataservice. Als toegang echter authenticatie of ondertekening van een licentieovereenkomst vereist, kunt u gewoon een link naar uw website/gegevensportaal toevoegen. Als uw gegevens niet op een bestaande website worden gehost, kunt u deze in dat geval uploaden op transportdata.be

source: Adding a link (or uploading a file) is compulsory as per Commission Delegated Regulation (EU) 2017/1926.
de: Das Hinzufügen eines Links (oder das Hochladen einer Datei) ist gemäß der delegierten Verordnung (EU) 2017/1926 der Kommission obligatorisch.
fr: L'ajout d'un lien (ou le téléchargement d'un fichier) est obligatoire conformément au règlement délégué (UE) 2017/1926 de la Commission.
nl: Het toevoegen van een link (of het uploaden van een bestand) is verplicht volgens de Gedelegeerde Verordening (EU) 2017/1926 van de Commissie.

source: Signed
de: Unterzeichnet
nl: Ondertekend

source: Transportation modes covered
nl: Vervoerswijzen gedekt

source: Metadata date
nl: Datum metadata

# Status
source: State
nl: Status

source: This dataset has no description
de: Dieser Datensatz hat keine Beschreibung.
fr: Ce jeu de données n'a pas de description.
nl: Er is geen beschrijving voor deze dataset

source: Edit settings
de: Parameter editieren
fr: Editer les paramètres
nl: Instellingen aanpassen

source: Have you just just created an account?
de: Haben Sie gerade ein Benutzerkonto erstellt?
fr: Vous venez de créer un compte?
nl: Heeft u zojuist een account aangemaakt?

source: If yes, you will find more information on what to do in our <a href="%(page_info)s">about section.</a>
de: Wenn ja, konsultieren Sie unseren <a href="%(page_info)s">Abschnitt für weitere Informationen.</a>
nl: Indien wel, dan vind u meer informatie over wat u kan doen op onze <a href="%(page_info)s">pagina 'Over'.</a>

source: Make sure to check your spam folder for the subscription e-mail.
de: Achten Sie darauf, Ihren Spam-Ordner für das Abonnement E-Mail zu überprüfen.
fr: Assurez-vous de vérifier votre dossier de spam pour l'e-mail d'abonnement.
nl: Zorg ervoor dat u uw spam-map controleert voor de abbonerings e-mail.

source: Forgotten your username?
de: Haben Sie Ihren Benutzernamen vergessen?
fr: Nom d'utilisateur oublié?
nl: Uw gebruikersnaam vergeten?

source: Send us an e-mail at <a href="mailto:contact@transportdata.be" target="_top">contact@transportdata.be</a> mentioning your name and, if applicable, your organisation.
de: Senden Sie uns eine E-Mail an <a href="mailto:contact@transportdata.be" target="_top">contact@transportdata.be</a> und nennen Sie Ihren Namen und gegebenenfalls Ihre Organisation.
fr: Envoyez-nous un email à <a href="mailto:contact@transportdata.be" target="_top">contact@transportdata.be</a> en mentionnant votre nom et, le cas échéant, votre organisation.
nl: Stuur ons een e-mail op <a href="mailto:contact@transportdata.be" target="_top">contact@transportdata.be</a> met uw naam en, indien van toepassing, uw organisatie.

source: Check our <a href="%(page_about)s">about section</a> to know more!
de: In unserem <a href="%(page_about)s">Abschnitt &quot;Über&quot;</a> lernen Sie mehr!
nl: Raadpleeg onze <a href="%(page_about)s">&#8220;over&#8221;</a> voor meer informatie!

source: How to sign up?
de: Wie melde ich mich an?
fr: Comment s'inscrire?
nl: Hoe aanmelden?

source: Please choose a username (and make sure never to forget it) containing only lowercase letters and no special character except - and _ Fill in the other fields and press "Create account"
de: Bitte wählen Sie einen Benutzernamen (und vergessen Sie ihn nicht), der nur Kleinbuchstaben und keine Sonderzeichen außer - und _ enthält. Füllen Sie die anderen Felder aus und drücken Sie "Konto erstellen".
fr: Veuillez choisir un nom d'utilisateur (et assurez-vous de ne jamais l'oublier) contenant uniquement des lettres minuscules et aucun caractère spécial sauf - et _ Remplissez les autres champs et appuyez sur "Créer un compte"
nl: Kies een gebruikersnaam (en zorg ervoor dat u deze nooit vergeet) met alleen kleine letters en geen speciale tekens behalve - of _ Vul de andere velden in en klik op "Account maken"

source: Sysadmin settings
de: Parameter des Systemadministrators
fr: Paramètres de l'administrateur système
nl: Instellingen van systeemadministrator

source: <p class="extra">Please try another search.</p>
nl: <p class="extra">Gelieve een andere zoekterm te gebruiken.</p>

source: <p id="search-error"><strong>There was an error while searching.</strong> Please try again.</p>
nl: <p id="search-error"><strong>Er was een fout tijdens het zoeken.</strong> Gelieve opnieuw te proberen.</p>

source: The <i>data license</i> you select above only applies to the contents of any resource files that you add to this dataset. By submitting this form, you agree to release the <i>metadata</i> values that you enter into the form under the <a href="http://opendatacommons.org/licenses/odbl/1-0/">Open Database License</a>.
de: Wenn Sie dieses Formular absenden, stimmen Sie zu, die <i>Metadaten</i> unter der <a href="http://opendatacommons.org/licenses/odbl/1-0/">Open Database License</a> zu veröffentlichen.
fr: En soumettant ce formulaire, vous vous engagez à libérer les valeurs des <i>métadonnées</ i> que vous entrez dans le formulaire en vertu de la <a href="http://opendatacommons.org/licenses/odbl/1-0/">Licence de base de données ouvertes</a>.
nl: By submitting this form, you agree to release the <i>metadata</i> values that you enter into the form under the <a href="http://opendatacommons.org/licenses/odbl/1-0/">Open Database License</a>.

source: Edit
nl: Bewerk

source: View profile
de: Profil ansehen
fr: Voir profil
nl: Profiel bekijken
