Repository: belgium-its-steering-committee/ckanext-benap
Catalog: ckanext/benap/i18n/*/LC_MESSAGES/ckanext-benap.po
Languages: de, fr, nl

source: Search datasets...
de: Datensätze durchsuchen...
fr: Recherche des ensembles de données...
nl: Zoek datasets...

source: Name Ascending
de: Name Aufsteigend
fr: Nom croissant
nl: Naam Aflopend

source: Name Descending
de: Name Absteigend
fr: Nom décroissant
nl: Naam Oplopend

source: Order by
de: Sortieren nach
fr: Ordre par
nl: Sorteren op

source: Activity from items that I'm following
de: Aktivität von Elementen, denen ich folge
fr: Activité à partir d'éléments que je suis
nl: Activiteit van items die ik volg

source: Why Sign Up?
de: Warum anmelden?
fr: Pourquoi s'inscrire?
nl: Waarom registreren?

source: Register for an Account
de: Registrieren Sie sich für ein Konto
fr: Inscrivez-vous pour un compte
nl: Registreer voor een account

source: News feed
de: Neuigkeiten
fr: Fil d'actualité
nl: Nieuwsfeed

source: There are no {facet_type} that match this search
de: Es gibt keine {facet_type}, die dieser Suche entsprechen
fr: Aucune {facet_type} ne correspond à cette recherche
nl: Er zijn geen {facet_type} dat overeenstemmen met deze zoekactie

source: Show Only Popular {facet_type}
de: Beliebte
fr: Popular {facet_type}
nl: Popular {facet_type}

source: Draft
de: Entworf
fr: Brouillon
nl: Concept

source: E.g. environment
de: Zum B. Umwelt
fr: Par ex. environnement
nl: Bv. leefmilieu

source: Register
de: Registrieren
fr: S'enregistrer
nl: Registreren

source: Forgot your password?
de: Haben Sie Ihr Kennwort vergessen?
fr: Mot de passe oublié?
nl: Uw wachtwoord vergeten?

source: No problem, use our password recovery form to reset it.
de: Kein Problem, nutzen Sie unser Formular um Ihr Passwort zurückzusetzen.
fr: Aucun problème, utilisez notre formulaire de regénération du mot de passe pour le réinitialiser.
nl: Geen probleem, gebruik ons wachtwoord herstelformulier om uw wachtwoord opnieuw in te stellen.

source: Then sign right up, it only takes a minute.
de: Dann registrieren Sie sich, es dauert nur eine Minute.
fr: Alors inscrivez-vous tout de suite, il n'y en a que pour une minute.
nl: Schrijf u nu in, het neemt slechts een minuut.

source: Need an Account?
de: Benötigen Sie ein Benutzerkonto?
fr: Vous avez besoin d'un Compte?
nl: Heeft uw een Account nodig?

source: Filter Results
de: Ergebnisse filtern
fr: Filtrer les résultats
nl: Resulaten filteren

source: Link to a URL on the internet (you can also link to an API)
de: Link zu einer URL auf der Website (Sie können auch einen Link zu einer API angeben)
nl: Link naar een URL op het internet (u kunt ook linken naar een API)

source: Upload
de: Hochladen
nl: Uploaden

source: Upload a file on your computer
de: Laden Sie eine Datei auf ihren Computer hoch
nl: Upload een bestand vanop uw computer

source: Organization
nl: Organisatie

source: Private
de: Privat
fr: Privé
nl: Privaat

source: The form contains invalid entries:
de: Das Formular enthält ungültige Einträge
nl: Het formulier bevat ongeldige gegevens

source: A little information about yourself
nl: Een beetje informatie over jezelf

source: Are you sure you want to delete this User?
nl: Ben je zeker dat je deze Gebruiker wil verwijderen?

source: Change details
nl: Contactgegevens veranderen

source: Change password
nl: Paswoord wijzigen

source: Confirm
nl: Bevestigen

source: Confirm Password
nl: Paswoord bevestigen

source: Create Account
nl: Account creëren

source: Full Name
nl: Volle naam

source: Full name
nl: Volle naam

source: Old Password
nl: Oud paswoord

source: Password
nl: Paswoord

source: Subscribe to notification emails
nl: Schrijf in op e-mail alerten

source: Sysadmin Password
nl: Paswoord van systeemadministrator

source: Update Profile
nl: Profiel bijwerken

source: eg. Joe Bloggs
nl: bv. Joe Bloggs

source: eg. joe@example.com
nl: bv. joe@voorbeeld.com

source: joe@example.com
nl: joe@voorbeeld.com

source: username
nl: Gebruikersnaam

source: Modification must done by a system administrator
de: Änderungen müssen von einem Systemadministrator vorgenommen werden
fr: La modification doit être effectuée par un administrateur système

source: Logged in one must be
de: Eingeloggt muss man sein
fr: La personne connectée doit être

source: https://www.youtube.com/embed/0-M48xzlWzI?rel=0&enablejsapi=1
de: https://www.youtube.com/embed/kB75uVs8oVo?rel=0&enablejsapi=1

source: More detailed instructions on how to register your dataset(s) and or services can be found in the <a href="%(page_about)s">about section</a> and in our <a href="%(video_url)s" target="_blank">instruction video</a>.
de: Ausführlichere Anweisungen zur Registrierung Ihrer Datensätze und Dienste finden Sie im <a href="%(page_about)s">Abschnitt &quot;Über&quot;</a> und in unserem <a href="%(video_url)s" target="_blank">Anleitungsvideo</a>.

source: Admin
de: Administrator

source: Dashboard (%(num)d new item)
de: Dashboard (%(num)d neuer Punkt)
fr: Tableau de bord (%(num)d nouvel élément

source: Settings
de: Parameter
fr: Paramètres

source: Log out
de: Abmeldung
fr: Déconnexion

source: Organizations
de: Organisationen
fr: Les organisations

source: Groups
de: Gruppen
fr: Groupes

source: Search
de: Suche
fr: Recherche

source: Go
de: Gehen
fr: Aller

source: Show More {facet_type}
de: Mehr anzeigen {facet_type}
fr: Voir plus {facet_type}

source: {num} Dataset
de: {num} Datensätz
fr: {num} Jeu de données

source: Deleted
de: gelöscht
fr: Supprimé

source: About
de: Über
fr: A propos

source: Type
de: Art

source: Welcome
de: Wilkommen
fr: Bienvenue

source: Registration
de: Registrierung
fr: Enregistrement

source: Forgotten your password?
de: Haben Sie Ihr Kennwort vergessen?
fr: Mot de passe oublié?

source: Create an Account
de: Erstelle ein Benutzerkonto
fr: Créer un Compte

source: My Organizations
de: meine Organisationen
fr: Mes organisations

source: Language
de: Sprache
fr: Langue

source: What's a resource?
de: Was ist eine Ressource?
fr: Qu'est-ce qu'une ressource?

source: Filters
de: Filter
fr: Filtres

source: Log in
de: Anmeldung
fr: Connexion

source: Remove
de: Entfernen
fr: Supprimer

source: Image
de: Bild

source: File
de: Datei

source: Datasets
de: Datensätze
fr: Jeux de données

source: Visibility
de: Sichtbarkeit

source: Dashboard
fr: Tableau de bord

source: More detailed instructions on how to register your dataset(s) and or services can be found in the
fr: Des instructions plus détaillées sur la façon d'enregistrer vos données et services peuvent être consultées dans

source: about section
fr: la section à propos

source: and in our
fr: ou par l'intermédiaire de notre

source: instruction video
fr: vidéo d'instructions

source: <strong>There was an error while searching.</strong> Please try again.
fr: <strong>Une erreur s'est produite lors de la recherche.</strong> Veuillez réessayer.

source: My Datasets
fr: Mes jeux de données

source: If yes, you will find more information on what to do in our
fr: Si oui, vous trouverez plus d'informations sur ce qu'il faut faire dans notre

source: about section.
fr: section A propos.

source: Check our
fr: consultez notre

source: to know more!
fr: pour en savoir plus!
